In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'col1': [1, 2, 3, 4],
                  'col2': [444, 555, 666, 444],
                  'col3': ['abc', 'def', 'ghi', 'xyz']})

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Methods to find unique values in dataframe

In [4]:
df['col2'].unique()

array([444, 555, 666])

Number of unique values

In [5]:
df['col2'].nunique()

3

Number of times unique values occure

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## Apply method
Call method from pandas

In [9]:
def times2(x):
    return x*2

In [10]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

Apply can also use lambdas.
Widely used with Pandas

In [13]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

## Sorting

In [14]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

Find NaN and null

In [18]:
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

## Pivot table

In [23]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar',],
        'B': ['one', 'two', 'one', 'two', 'one', 'two',],
        'C': ['x', 'y', 'x', 'y', 'x', 'y',],
        'D': [1, 3, 2, 5, 4, 1]}
df = pd.DataFrame(data)

In [24]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  two  y  3
2  foo  one  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  two  y  1

In [25]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  NaN
    two  NaN  3.0
foo one  1.5  NaN
    two  NaN  3.0